In [10]:
# Import Dependencies
import pandas as pd
pd.options.mode.chained_assignment = None
from datetime import timedelta, date
import numpy as np
import matplotlib.pyplot as plt
import requests as requests
import time
from scipy import stats 
#import linregress
import json

In [11]:
#CDC COVID-19 vaccination in the US url
vax_url = "https://data.cdc.gov/resource/8xkx-amqh"

In [12]:
#request API and get json objects

# vax_response = requests.get(vax_url).json()
# vax_response

In [13]:
# len(vax_response)

In [14]:
# vax_url = "https://data.cdc.gov/resource/8xkx-amqh"
# #request API and get json objects

# # vax_response = requests.get(vax_url).json()
# # vax_response

# df=pd.read_json("https://data.cdc.gov/resource/8xkx-amqh.json?$limit=25000")
# ##df=pd.read_json("https://data.cdc.gov/resource/8xkx-amqh.json?$where=date_extract_y(date)<2021&$limit=25000")

In [15]:
# vax_response = requests.get("https://data.cdc.gov/resource/8xkx-amqh.json?$where="
#                   "(date_extract_y(date)%20%3C=%202021%20AND%20date_extract_m(date)%20%3C=9)")
# vax_response_json=vax_response.json()

In [16]:
# # increasing the data rows to be pulled to a count
# df = pd.read_json("https://data.cdc.gov/resource/8xkx-amqh.json?$where="
#                  "(date_extract_y(date)%20%3C=%202021%20AND%20date_extract_m(date)%20%3C=9)&$limit=25000")

In [17]:
#df.info()

In [18]:
#new_df=df[["date","recip_county"]]

In [23]:
#new_df.head()

In [24]:
#CDC COVID-19 mortality rate in the US by age and sex url
mort_url = "https://data.cdc.gov/resource/9bhg-hcku"

In [25]:
#Data frame of the CDC COVID-19 mortality rate in the US by age and sex as of 09/30/2021
#df_mort = pd.read_json("https://data.cdc.gov/resource/9bhg-hcku.json?$where="
#                  "(date_extract_y(end_date)%20%3C=%202021%20AND%20date_extract_m(end_date)%20%3C=9)&$limit=500000")

In [26]:
df_mort = pd.read_json("https://data.cdc.gov/resource/9bhg-hcku.json?$limit=1000000")

In [27]:
len(df_mort)

68850

In [28]:
# Displaying one record 
df_mort.iloc[500]

data_as_of                                                 2021-10-20T00:00:00.000
start_date                                                 2020-01-01T00:00:00.000
end_date                                                   2021-10-16T00:00:00.000
group                                                                     By Total
state                                                         District of Columbia
sex                                                                         Female
age_group                                                              25-34 years
covid_19_deaths                                                                NaN
total_deaths                                                                 116.0
pneumonia_deaths                                                              10.0
pneumonia_and_covid_19_deaths                                                  NaN
influenza_deaths                                                               0.0
pneumonia_influenza_or_covid                                                  12.0
footnote                         One or more data cells have counts between 1-9...
year                                                                           NaN
month                                                                          NaN
Name: 500, dtype: object

In [29]:
#data frame with required fields
new_df=df_mort[["group","year","month","state","sex","age_group","covid_19_deaths",
                "total_deaths"]]
pd.options.display.float_format = "{:.0f}".format

In [30]:
new_df

,group,year,month,state,sex,age_group,covid_19_deaths,total_deaths
0,By Total,NaN,NaN,United States,All Sexes,All Ages,723880,5928410
1,By Total,NaN,NaN,United States,All Sexes,Under 1 year,132,33432
2,By Total,NaN,NaN,United States,All Sexes,0-17 years,542,59268
3,By Total,NaN,NaN,United States,All Sexes,1-4 years,63,6236
4,By Total,NaN,NaN,United States,All Sexes,5-14 years,172,9911
...,...,...,...,...,...,...,...,...
68845,By Month,2021,10,Puerto Rico,Female,50-64 years,NaN,21
68846,By Month,2021,10,Puerto Rico,Female,55-64 years,NaN,17
68847,By Month,2021,10,Puerto Rico,Female,65-74 years,NaN,19
68848,By Month,2021,10,Puerto Rico,Female,75-84 years,NaN,29
68849,By Month,2021,10,Puerto Rico,Female,85 years and over,NaN,38

In [31]:
new_df.drop(new_df.loc[(new_df["month"] == 10)&(new_df["year"] == 2021)].index, inplace=True)

In [50]:
#Dropping data for age_groups -"Under 1 year", "1-4 years", "All Ages","5-14 years","15-24 years"
# and "25-34 years" , "35-44 years",  "45-54 years",  "55-64 years"

new_df.drop(new_df.loc[new_df["age_group"]=="Under 1 year"].index, inplace=True)

new_df.drop(new_df.loc[new_df["age_group"]=="1-4 years"].index, inplace=True)

new_df.drop(new_df.loc[new_df["age_group"]=="All Ages"].index, inplace=True)

new_df.drop(new_df.loc[new_df["age_group"]=="5-14 years"].index, inplace=True)

new_df.drop(new_df.loc[new_df["age_group"]=="15-24 years"].index, inplace=True)


new_df.drop(new_df.loc[new_df["age_group"]=="25-34 years"].index, inplace=True)
new_df.drop(new_df.loc[new_df["age_group"]=="35-44 years"].index, inplace=True)
new_df.drop(new_df.loc[new_df["age_group"]=="45-54 years"].index, inplace=True) 
new_df.drop(new_df.loc[new_df["age_group"]=="55-64 years"].index, inplace=True)
new_df.drop(new_df.loc[new_df["state"]=="United States"].index, inplace=True)

In [51]:
new_df["age_group"].unique()

array(['0-17 years', '18-29 years', '30-39 years', '40-49 years',
       '50-64 years', '65-74 years', '75-84 years', '85 years and over'],
      dtype=object)

In [52]:
new_df.reset_index()

,index,group,year,month,state,sex,age_group,covid_19_deaths,total_deaths
0,53,By Total,NaN,NaN,Alabama,All Sexes,0-17 years,NaN,1270
1,57,By Total,NaN,NaN,Alabama,All Sexes,18-29 years,97,2197
2,59,By Total,NaN,NaN,Alabama,All Sexes,30-39 years,290,3219
3,61,By Total,NaN,NaN,Alabama,All Sexes,40-49 years,752,5485
4,63,By Total,NaN,NaN,Alabama,All Sexes,50-64 years,3167,21930
...,...,...,...,...,...,...,...,...,...
30523,68792,By Month,2021,9,Puerto Rico,Female,40-49 years,NaN,27
30524,68794,By Month,2021,9,Puerto Rico,Female,50-64 years,30,124
30525,68796,By Month,2021,9,Puerto Rico,Female,65-74 years,25,180
30526,68797,By Month,2021,9,Puerto Rico,Female,75-84 years,27,297
30527,68798,By Month,2021,9,Puerto Rico,Female,85 years and over,17,398

In [57]:
# Mortality rate Vs Gender  - Data for Pie Chart
gender_df=new_df.groupby(by=["sex"]).sum()
gender_df = gender_df.drop("year",1)
gender_df = gender_df.drop("month",1)

In [58]:
gender_df

           covid_19_deaths  total_deaths
sex
All Sexes          2164052      17903487
Female              965456       8470478
Male               1187454       9426288

In [59]:
#Mortality rate by age group - Data for scatter plot

age_group_df=new_df.groupby(by=["age_group"]).sum()
age_group_df = age_group_df.drop("year",1)
age_group_df = age_group_df.drop("month",1)
#covid_19_deaths_sum = age_group_df["covid_19_deaths"].sum()
#total_deaths_sum = age_group_df["total_deaths"]

#covid_19_deaths_sum = age_group_df["covid_19_deaths"].sum()

In [60]:
age_group_df
#covid_19_deaths_sum()

                   covid_19_deaths  total_deaths
age_group
0-17 years                    1256        353138
18-29 years                  19536        679629
30-39 years                  64338        987094
40-49 years                 168517       1478254
50-64 years                 770258       6030942
65-74 years                 977642       7277712
75-84 years                1137455       8660464
85 years and over          1177960      10333020

In [61]:
#Mortality By state - Data horizontal bar graph
state_df=new_df.groupby(by=["state"]).sum()
state_df.loc['New York'] += state_df.loc['New York City']
state_df.drop(['New York City'], inplace=True)
state_df = state_df.drop("year",1)
state_df = state_df.drop("month",1)

In [62]:
state_df

                      covid_19_deaths  total_deaths
state
Alabama                         88481        684236
Alaska                           3082         51557
Arizona                        110218        824386
Arkansas                        49314        407525
California                     442371       3433364
Colorado                        48608        494390
Connecticut                     51323        370633
Delaware                        11062        114545
District of Columbia             8663         75839
Florida                        337012       2693274
Georgia                        145043       1113226
Hawaii                           4544        129278
Idaho                           18652        177050
Illinois                       147901       1304644
Indiana                         94595        810808
Iowa                            40605        358968
Kansas                          35826        323483
Kentucky                        61035        589274
Louisiana                       75876        588595
Maine                            6560        167612
Maryland                        67194        615871
Massachusetts                   85105        697841
Michigan                       119734       1179614
Minnesota                       50197        529958
Mississippi                     60309        414811
Missouri                        87019        792156
Montana                         12534        125065
Nebraska                        19240        198614
Nevada                          45541        338722
New Hampshire                    8346        141606
New Jersey                     154747        945473
New Mexico                      28181        238175
New York                       343160       2024058
North Carolina                 114993       1060406
North Dakota                    10589         85704
Ohio                           158358       1485160
Oklahoma                        65330        494668
Oregon                          25278        435622
Pennsylvania                   185160       1610740
Puerto Rico                     17954        340549
Rhode Island                    16199        121328
South Carolina                  76673        645306
South Dakota                    12703         99384
Tennessee                      108807        953822
Texas                          434710       2742284
Utah                            18868        235235
Vermont                          1380         64312
Virginia                        78301        852182
Washington                      46020        679098
West Virginia                   22224        247717
Wisconsin                       56051        634528
Wyoming                          5286         57557

In [41]:
sorted_state_df= state_df.sort_values("covid_19_deaths",ascending=False)

In [42]:
# Mortlaity by State counts sorted in descending order
sorted_state_df["covid_19_deaths"]

state
United States          4327618
California              442371
Texas                   434710
New York                343160
Florida                 337012
Pennsylvania            185160
Ohio                    158358
New Jersey              154747
Illinois                147901
Georgia                 145043
Michigan                119734
North Carolina          114993
Arizona                 110218
Tennessee               108807
Indiana                  94595
Alabama                  88481
Missouri                 87019
Massachusetts            85105
Virginia                 78301
South Carolina           76673
Louisiana                75876
Maryland                 67194
Oklahoma                 65330
Kentucky                 61035
Mississippi              60309
Wisconsin                56051
Connecticut              51323
Minnesota                50197
Arkansas                 49314
Colorado                 48608
Washington               46020
Nevada                   45541
Iowa                     40605
Kansas                   35826
New Mexico               28181
Oregon                   25278
West Virginia            22224
Nebraska                 19240
Utah                     18868
Idaho                    18652
Puerto Rico              17954
Rhode Island             16199
South Dakota             12703
Montana                  12534
Delaware                 11062
North Dakota             10589
District of Columbia      8663
New Hampshire             8346
Maine                     6560
Wyoming                   5286
Hawaii                    4544
Alaska                    3082
Vermont                   1380
Name: covid_19_deaths, dtype: float64

In [63]:
#Mortality rate for Gender types for different age groups - Stacked bar graph

gender_agegroup_df=new_df.groupby(by=["sex","age_group"]).sum()
gender_agegroup_df = gender_agegroup_df.drop("year",1)
gender_agegroup_df = gender_agegroup_df.drop("month",1)

In [64]:
gender_agegroup_df

                             covid_19_deaths  total_deaths
sex       age_group
All Sexes 0-17 years                     823        177685
          18-29 years                  10278        340850
          30-39 years                  33091        494339
          40-49 years                  85472        739544
          50-64 years                 385891       3015471
          65-74 years                 489493       3638856
          75-84 years                 569357       4330232
          85 years and over           589647       5166510
Female    0-17 years                     156         72457
          18-29 years                   3446         89825
          30-39 years                  11248        157522
          40-49 years                  29268        267318
          50-64 years                 142012       1152828
          65-74 years                 194549       1525645
          75-84 years                 249029       2069538
          85 years and over           335748       3135345
Male      0-17 years                     277        102996
          18-29 years                   5812        248954
          30-39 years                  19999        335233
          40-49 years                  53777        471392
          50-64 years                 242355       1862643
          65-74 years                 293600       2113211
          75-84 years                 319069       2260694
          85 years and over           252565       2031165

In [46]:
#Mortality total count per year 

Year_group_df=new_df.groupby(by=["year"]).sum()

Year_group_df

      month  covid_19_deaths  total_deaths
year
2020 101088          3074629      27229232
2021  58320          2668896      20212421

In [47]:
#Mortality rate for Year for different age groups 

Year_Month_df=new_df.groupby(by=["year","month"]).sum()
#gender_agegroup_df=new_df.groupby(by=["sex","age_group"]).sum()
Year_Month_df

            covid_19_deaths  total_deaths
year month
2020 1                   10       1063229
     2                   40        983899
     3                27248       1083873
     4               260766       1293527
     5               151901       1126216
     6                70689       1005728
     7               123182       1120452
     8               118516       1114013
     9                75672       1033098
     10               98693       1099958
     11              212198       1214662
     12              392122       1473300
2021 1               420287       1497786
     2               192354       1133002
     3                91059       1086720
     4                73269       1030044
     5                57870       1030910
     6                29717        968154
     7                42116       1005536
     8               186554       1162988
     9               219134       1087149

In [48]:
Year_Month_df["covid_19_deaths"]

year  month
2020  1           10
      2           40
      3        27248
      4       260766
      5       151901
      6        70689
      7       123182
      8       118516
      9        75672
      10       98693
      11      212198
      12      392122
2021  1       420287
      2       192354
      3        91059
      4        73269
      5        57870
      6        29717
      7        42116
      8       186554
      9       219134
Name: covid_19_deaths, dtype: float64